In [1]:
import pandas as pd, requests, time
from bs4 import BeautifulSoup
from random import randrange
from selenium import webdriver

In [2]:
url = 'http://www.lawhiskeysociety.com/whiskey_list.php?brand=&dist=&order=name&asc=ASC&page=0&f_records=100000&f_alpha=&f_reset=1&f_a_reset=0&f_multiple=0&f___type=0&f_subtype=0&f_member=0&f_added=0'

driver = webdriver.Chrome(executable_path='../chromedriver/chromedriver')

In [3]:
driver.get(url)
res = requests.get(url)

In [4]:
res.status_code

200

In [5]:
soup = BeautifulSoup(driver.page_source)

In [6]:
names = []
ratings = []

In [7]:
table = soup.find('table', attrs={'class':'tableContent'})

In [8]:
for row in table.select('tr'):
    for line in row.find_all('td'):
        name = {}
        try:
            name['name'] = line.find('a', attrs = {'class': "whiskeyLinkPopup"}).text
            names.append(name)
        except:
            pass

In [9]:
for row in table.select('tr'):
    for line in row.select('table'):
        for item in line.find_all('td', {'width': 30}):
            rate = {}
            rate['rating'] = item.find_next('td').text
            ratings.append(rate)

In [10]:
name_df = pd.DataFrame(names)
rating_df = pd.DataFrame(ratings)

In [11]:
name_df.head()

                              name
0                            (ri)1
1              1512 Barbershop Rye
2                  1792 Full Proof
3           1792 Ridgemont Reserve
4  200th Anniversary Evan Williams

In [12]:
rating_df.head(10)

             rating
0   \n      C
1  \n      C-
2   \n      B
3  \n      C-
4   \n      B
5  \n      B+
6  \n      B+
7   \n      B
8  \n      B-
9  \n      B+

In [13]:
df = name_df.merge(rating_df, left_index= True, right_index=True)

In [14]:
df.head()

                              name            rating
0                            (ri)1   \n      C
1              1512 Barbershop Rye  \n      C-
2                  1792 Full Proof   \n      B
3           1792 Ridgemont Reserve  \n      C-
4  200th Anniversary Evan Williams   \n      B

In [15]:
df.to_csv('../CSV\'s/whiskey_society.csv', index=False)